---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DpartCanHostRebar
source: html/dfbb5824-a1f3-8292-8265-0555a67187b6.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DpartCanHostRebar Property

"Can host rebar"

## Syntax (C#)
```csharp
public static ForgeTypeId DpartCanHostRebar { get; }
```